HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxXbar_bf.h
/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN25 */
#define IFX_XBAR_ACCEN0_EN25_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN25 */
#define IFX_XBAR_ACCEN0_EN25_OFF (25)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN26 */
#define IFX_XBAR_ACCEN0_EN26_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN26 */
#define IFX_XBAR_ACCEN0_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN26 */
#define IFX_XBAR_ACCEN0_EN26_OFF (26)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN27 */
#define IFX_XBAR_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN27 */
#define IFX_XBAR_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN27 */
#define IFX_XBAR_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN28 */
#define IFX_XBAR_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN28 */
#define IFX_XBAR_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN28 */
#define IFX_XBAR_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN29 */
#define IFX_XBAR_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN29 */
#define IFX_XBAR_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN29 */
#define IFX_XBAR_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN2 */
#define IFX_XBAR_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN2 */
#define IFX_XBAR_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN2 */
#define IFX_XBAR_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN30 */
#define IFX_XBAR_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN30 */
#define IFX_XBAR_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN30 */
#define IFX_XBAR_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN31 */
#define IFX_XBAR_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN31 */
#define IFX_XBAR_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN31 */
#define IFX_XBAR_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN3 */
#define IFX_XBAR_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN3 */
#define IFX_XBAR_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN3 */
#define IFX_XBAR_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN4 */
#define IFX_XBAR_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN4 */
#define IFX_XBAR_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN4 */
#define IFX_XBAR_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN5 */
#define IFX_XBAR_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN5 */
#define IFX_XBAR_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN5 */
#define IFX_XBAR_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN6 */
#define IFX_XBAR_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN6 */
#define IFX_XBAR_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN6 */
#define IFX_XBAR_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN7 */
#define IFX_XBAR_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN7 */
#define IFX_XBAR_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN7 */
#define IFX_XBAR_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN8 */
#define IFX_XBAR_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN8 */
#define IFX_XBAR_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN8 */
#define IFX_XBAR_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_XBAR_ACCEN0_Bits.EN9 */
#define IFX_XBAR_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ACCEN0_Bits.EN9 */
#define IFX_XBAR_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ACCEN0_Bits.EN9 */
#define IFX_XBAR_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.INTACK */
#define IFX_XBAR_ARBCON_INTACK_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.INTACK */
#define IFX_XBAR_ARBCON_INTACK_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.INTACK */
#define IFX_XBAR_ARBCON_INTACK_OFF (4)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.PRERREN */
#define IFX_XBAR_ARBCON_PRERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.PRERREN */
#define IFX_XBAR_ARBCON_PRERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.PRERREN */
#define IFX_XBAR_ARBCON_PRERREN_OFF (0)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SCERREN */
#define IFX_XBAR_ARBCON_SCERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SCERREN */
#define IFX_XBAR_ARBCON_SCERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SCERREN */
#define IFX_XBAR_ARBCON_SCERREN_OFF (1)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SETPRINT */
#define IFX_XBAR_ARBCON_SETPRINT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SETPRINT */
#define IFX_XBAR_ARBCON_SETPRINT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SETPRINT */
#define IFX_XBAR_ARBCON_SETPRINT_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SETSCINT */
#define IFX_XBAR_ARBCON_SETSCINT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SETSCINT */
#define IFX_XBAR_ARBCON_SETSCINT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SETSCINT */
#define IFX_XBAR_ARBCON_SETSCINT_OFF (3)

/** \\brief  Length for Ifx_XBAR_ARBCON_Bits.SPC */
#define IFX_XBAR_ARBCON_SPC_LEN (12)

/** \\brief  Mask for Ifx_XBAR_ARBCON_Bits.SPC */
#define IFX_XBAR_ARBCON_SPC_MSK (0xfff)

/** \\brief  Offset for Ifx_XBAR_ARBCON_Bits.SPC */
#define IFX_XBAR_ARBCON_SPC_OFF (20)

/** \\brief  Length for Ifx_XBAR_ARBITER0_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER0_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER0_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBADD_ADDRESS_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER0_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBMADD_ADDRESS_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER0_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBMADD_ADDRESS_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER0_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER0_DBMADD_ADDRESS_OFF (2)

