HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS1_OFF (23)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS2 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS2 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS2 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS2_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS3 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS3 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS3 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS3_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS4 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS4 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS4 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS4_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER2_DBADD_ONE0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER2_DBADD_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER2_DBADD_ONE0_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER2_DBADD_ONE1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER2_DBADD_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER2_DBADD_ONE1_OFF (30)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS1_OFF (23)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS2 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS2 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS2 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS2_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS3 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS3 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS3 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS3_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS4 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS4 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS4 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS4_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE0_LEN (2)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE0_MSK (0x3)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE0_OFF (21)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE1_LEN (3)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE1_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE1_OFF (24)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE2 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE2 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE2 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE2_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE3 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE3 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE3 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE3_OFF (30)

/** \\brief  Length for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_OFF (2)

