HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_LEN (25)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_MSK (0x1ffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_LEN (3)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS0_LEN (25)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS0_MSK (0x1ffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS1_LEN (3)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS1_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS1_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE0_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE1_OFF (31)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS1_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE0_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE0_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE0_OFF (21)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE1_LEN (2)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE1_MSK (0x3)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE1_OFF (30)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_MSK (0x1)

