HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI0 */
#define IFX_XBAR_IDINTSAT_IDMCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI10 */
#define IFX_XBAR_IDINTSAT_IDMCI10_OFF (26)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI11 */
#define IFX_XBAR_IDINTSAT_IDMCI11_OFF (27)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI12 */
#define IFX_XBAR_IDINTSAT_IDMCI12_OFF (28)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI13 */
#define IFX_XBAR_IDINTSAT_IDMCI13_OFF (29)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI4 */
#define IFX_XBAR_IDINTSAT_IDMCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI5 */
#define IFX_XBAR_IDINTSAT_IDMCI5_OFF (21)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI6 */
#define IFX_XBAR_IDINTSAT_IDMCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI8 */
#define IFX_XBAR_IDINTSAT_IDMCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDMCI9 */
#define IFX_XBAR_IDINTSAT_IDMCI9_OFF (25)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_OFF (17)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_OFF (18)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_OFF (23)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_LEN (1)

