HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxXbar_bf.h
/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCID */
#define IFX_XBAR_INTSAT_PRSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCID */
#define IFX_XBAR_INTSAT_PRSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCID */
#define IFX_XBAR_INTSAT_PRSCID_OFF (31)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI0 */
#define IFX_XBAR_INTSAT_SCSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI0 */
#define IFX_XBAR_INTSAT_SCSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI0 */
#define IFX_XBAR_INTSAT_SCSCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI1 */
#define IFX_XBAR_INTSAT_SCSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI1 */
#define IFX_XBAR_INTSAT_SCSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI1 */
#define IFX_XBAR_INTSAT_SCSCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI2 */
#define IFX_XBAR_INTSAT_SCSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI2 */
#define IFX_XBAR_INTSAT_SCSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI2 */
#define IFX_XBAR_INTSAT_SCSCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI4 */
#define IFX_XBAR_INTSAT_SCSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI4 */
#define IFX_XBAR_INTSAT_SCSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI4 */
#define IFX_XBAR_INTSAT_SCSCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI6 */
#define IFX_XBAR_INTSAT_SCSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI6 */
#define IFX_XBAR_INTSAT_SCSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI6 */
#define IFX_XBAR_INTSAT_SCSCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI7 */
#define IFX_XBAR_INTSAT_SCSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI7 */
#define IFX_XBAR_INTSAT_SCSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI7 */
#define IFX_XBAR_INTSAT_SCSCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI8 */
#define IFX_XBAR_INTSAT_SCSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI8 */
#define IFX_XBAR_INTSAT_SCSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI8 */
#define IFX_XBAR_INTSAT_SCSCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCID */
#define IFX_XBAR_INTSAT_SCSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCID */
#define IFX_XBAR_INTSAT_SCSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCID */
#define IFX_XBAR_INTSAT_SCSCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER10 */
#define IFX_XBAR_PRIOH_MASTER10_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER10 */
#define IFX_XBAR_PRIOH_MASTER10_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER10 */
#define IFX_XBAR_PRIOH_MASTER10_OFF (8)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER11 */
#define IFX_XBAR_PRIOH_MASTER11_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER11 */
#define IFX_XBAR_PRIOH_MASTER11_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER11 */
#define IFX_XBAR_PRIOH_MASTER11_OFF (12)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER12 */
#define IFX_XBAR_PRIOH_MASTER12_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER12 */
#define IFX_XBAR_PRIOH_MASTER12_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER12 */
#define IFX_XBAR_PRIOH_MASTER12_OFF (16)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER13 */
#define IFX_XBAR_PRIOH_MASTER13_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER13 */
#define IFX_XBAR_PRIOH_MASTER13_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER13 */
#define IFX_XBAR_PRIOH_MASTER13_OFF (20)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER8 */
#define IFX_XBAR_PRIOH_MASTER8_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER8 */
#define IFX_XBAR_PRIOH_MASTER8_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER8 */
#define IFX_XBAR_PRIOH_MASTER8_OFF (0)

/** \\brief  Length for Ifx_XBAR_PRIOH_Bits.MASTER9 */
#define IFX_XBAR_PRIOH_MASTER9_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOH_Bits.MASTER9 */
#define IFX_XBAR_PRIOH_MASTER9_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOH_Bits.MASTER9 */
#define IFX_XBAR_PRIOH_MASTER9_OFF (4)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER0 */
#define IFX_XBAR_PRIOL_MASTER0_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER0 */
#define IFX_XBAR_PRIOL_MASTER0_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER0 */
#define IFX_XBAR_PRIOL_MASTER0_OFF (0)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER4 */
#define IFX_XBAR_PRIOL_MASTER4_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER4 */
#define IFX_XBAR_PRIOL_MASTER4_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER4 */
#define IFX_XBAR_PRIOL_MASTER4_OFF (16)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER5 */
#define IFX_XBAR_PRIOL_MASTER5_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER5 */
#define IFX_XBAR_PRIOL_MASTER5_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER5 */
#define IFX_XBAR_PRIOL_MASTER5_OFF (20)

/** \\brief  Length for Ifx_XBAR_PRIOL_Bits.MASTER6 */
#define IFX_XBAR_PRIOL_MASTER6_LEN (3)

/** \\brief  Mask for Ifx_XBAR_PRIOL_Bits.MASTER6 */
#define IFX_XBAR_PRIOL_MASTER6_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_PRIOL_Bits.MASTER6 */
#define IFX_XBAR_PRIOL_MASTER6_OFF (24)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXXBAR_BF_H */
